Revit 2027 API
PulldownButton.GetItems Method
Gets a copy of the collection of buttons assigned to the pulldown button.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<PushButton> GetItems()
Public Function GetItems As IList(Of PushButton)
public:
IList<PushButton^>^ GetItems()
member GetItems : unit -> IList<PushButton>
Return Value
IList<PushButton>
See Also
Reference
PulldownButton Class
Autodesk.Revit.UI Namespace